doc/faq-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>faq-cn</title>
<!-- 2016-02-02 Tue 18:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Haojun Bao" />
</head>
<body>
<div id="content">
<h1 class="title">faq-cn</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 如何更改java或其他软件版本（默认为1.6，如何改为1.7）</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 如何更改java或其他软件版本（默认为1.6，如何改为1.7）</h2>
<div class="outline-text-2" id="text-1">
<p>
system-config会修改你的系统的一些环境变量，其中最重要的一个是PATH，在ubuntu/debian自带的PATH变量前面，加上一些system-config自己的PATH路径，比如 <code>~/system-config/bin</code> 等。所以像系统java版本的问题，因为system-config会在 <code>~/external/bin/Linux/ext/jdk/bin</code> 下放一个 oracle 的 1.6 版java，并且这个路径在PATH变量里排在 <code>/usr/bin/</code> 前面，所以不管你怎么用 <code>update-alternatives</code> 修改 <code>/usr/bin/java</code> 的版本，你在命令行输入 <code>java -version</code> 看到的永远是 1.6 。
</p>

<p>
所以，要修改你的java版本，有两种办法：
</p>

<ol class="org-ol">
<li>临时修改一下 PATH 环境变量，比如在命令行上执行 <code>PATH=/usr/bin:$PATH</code> ，然后再执行 <code>java</code> 。
</li>

<li>在 <code>~/system-config/bin/overide</code> 创建指向一个 <code>/usr/bin/java</code> 的软链接。
</li>
</ol>

<p>
以下是一些查看各种程序版本的一些有用的命令：
</p>

<div class="org-src-container">

<pre class="src src-sh">which java <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#26174;&#31034;java&#31243;&#24207;&#22312;PATH&#21464;&#37327;&#37324;&#25214;&#21040;&#30340;&#31532;&#19968;&#20010;&#36335;&#24452;</span>
<span style="color: #b0c4de;">type</span> java <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#19982;&#19978;&#38754;&#31867;&#20284;&#65292;&#20294;&#22914;&#26524; java &#34987;&#23450;&#20041;&#25104;&#19968;&#20010; alias&#12289;function&#65292;&#20063;&#21487;&#20197;&#26377;&#26174;&#31034;</span>
<span style="color: #b0c4de;">type</span> -a java <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#26174;&#31034; java &#30340;&#25152;&#20197;&#29256;&#26412;&#65288;alias&#12289;function&#12289;&#22312;PATH&#21464;&#37327;&#37324;&#33021;&#25214;&#21040;&#30340;&#25152;&#26377;&#29256;&#26412;&#65289;</span>
</pre>
</div>

<p>
注意如果要永久修改自己的 <code>PATH</code> 环境变量的话，一定要在 <code>~/.bashrc</code> 的末尾处修改，这样能保证 system-config 对 <code>PATH</code> 变量的修改已经完成。如果放在 system-config 之前修改 PATH 的话，system-config再修改的时候，你的修改会被冲掉。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Haojun Bao</p>
<p class="date">Created: 2016-02-02 Tue 18:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
